In [64]:
import pandas as pd
import numpy as np

# 情境 1: 欄位全部為數字（譬如：ID號）
data1 = {
    'ID': [1001, 1002, 1003, 1004],
    'weight': [51.3, 30, 38.5, 92]
}

# 情境 2: 欄位包含數字和文字（譬如：產品編號和產品名稱）
data2 = {
    'Product Code': ['001', '002', '003', 'A04'],
    'Product Name': ['Table', 'Chair', 'Desk', 'Lamp']
}

# 情境 3: 欄位包含數字和 NA 值（譬如：員工的工作年數，未知值用 NA 代替）
data3 = {
    'Employee Name': ['John Doe', 'Jane Smith', 'Emily Jones', 'Michael Brown'],
    'Years of Service': ['0005', 8, np.nan, 0.2]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

# 儲存為 CSV 檔案
df1.to_csv('sample_data_scenario1.csv', index=False)
df2.to_csv('sample_data_scenario2.csv', index=False)
df3.to_csv('sample_data_scenario3.csv', index=False)
df3

   Employee Name Years of Service
0       John Doe             0005
1     Jane Smith                8
2    Emily Jones              NaN
3  Michael Brown              0.2

In [39]:
df3

   Employee Name  Years of Service
0       John Doe               5.0
1     Jane Smith               8.0
2    Emily Jones               NaN
3  Michael Brown               2.0

In [20]:
print('1')

print(df1.info())
print()
print('2')
print(df2.info())
print()

print('3')
print(df3.info())

1
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4 non-null      int64
 1   weight  4 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 192.0 bytes
None

2
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product Code  4 non-null      object
 1   Product Name  4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes
None

3
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee Name     4 non-null      object
 1   Years of Service  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 192.0+ bytes
None

In [42]:
df3 = pd.read_csv('sample_data_scenario3.csv', dtype=object)
print(df3.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee Name     4 non-null      object
 1   Years of Service  3 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes
None

In [57]:
df3 = pd.read_csv('sample_data_scenario3.csv', dtype={'Employee Name': object, 'Years of Service': float})
print(df3.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee Name     4 non-null      object
 1   Years of Service  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 192.0+ bytes
None

In [70]:
data3 = {
    'Employee Name': ['John Doe', 'Jane Smith', 'Emily Jones', 'Michael Brown'],
    'Years of Service': ['0005', 8, np.nan, 0.2]
}

df3 = pd.DataFrame(data3)
df3

   Employee Name Years of Service
0       John Doe             0005
1     Jane Smith                8
2    Emily Jones              NaN
3  Michael Brown              0.2

In [68]:
df3 = pd.read_csv('sample_data_scenario3.csv')
print(df3.info())
df3

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee Name     4 non-null      object
 1   Years of Service  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 192.0+ bytes
None

   Employee Name  Years of Service
0       John Doe               5.0
1     Jane Smith               8.0
2    Emily Jones               NaN
3  Michael Brown               0.2

In [71]:
df3 = pd.read_csv('sample_data_scenario3.csv')
df3['Years of Service'] = df3['Years of Service'].astype('string')
print(df3.info())
df3

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee Name     4 non-null      object
 1   Years of Service  3 non-null      string
dtypes: object(1), string(1)
memory usage: 192.0+ bytes
None

   Employee Name Years of Service
0       John Doe              5.0
1     Jane Smith              8.0
2    Emily Jones             <NA>
3  Michael Brown              0.2

In [60]:

df_scenario1 = pd.read_csv('sample_data_scenario1.csv', dtype=object)
print(df_scenario1.info())
df_scenario1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4 non-null      object
 1   weight  4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes
None

     ID weight
0  1001   51.3
1  1002   30.0
2  1003   38.5
3  1004   92.0